Changed chart to Mermaid
